Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/svd/PIC32CZ8110CA80100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OSCCTRL</name>
         <version>037182a0</version>
         <description>Oscillators Control</description>
         <groupName>OSCCTRL</groupName>
         <prependToName>OSCCTRL_</prependToName>
         <baseAddress>0x44040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>OSCCTRL_FAIL</name>
            <value>5</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_XOSCRDY</name>
            <value>6</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_DFLLRDY</name>
            <value>7</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_OTHER</name>
            <value>8</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_LOCK</name>
            <value>9</value>
         </interrupt>
         <registers>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFDEO</name>
                     <description>Clock Failure Detector Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL</name>
                     <description>XOSC Startup Failure Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC Clock Failure Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLOCK</name>
                     <description>DFLL Lock Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOVF</name>
                     <description>DFLL Tuner Overflow Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLUNF</name>
                     <description>DFLL Tuner Underflow Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLFAIL</name>
                     <description>DFLL Startup Failure Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKR</name>
                     <description>PLL 0 Lock Rise Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKF</name>
                     <description>PLL 0 Lock Fall Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKR</name>
                     <description>PLL 1 Lock Rise Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKF</name>
                     <description>PLL 1 Lock Fall Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL</name>
                     <description>XOSC Startup Failure Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC Clock Failure Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLOCK</name>
                     <description>DFLL Lock Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOVF</name>
                     <description>DFLL Tuner Overflow Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLUNF</name>
                     <description>DFLL Tuner Underflow Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLFAIL</name>
                     <description>DFLL Startup Failure Interrupt Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKR</name>
                     <description>PLL 0 Lock Rise Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKF</name>
                     <description>PLL 0 Lock Fall Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKR</name>
                     <description>PLL 1 Lock Rise Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKF</name>
                     <description>PLL 1 Lock Fall Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL</name>
                     <description>XOSC Startup Failure</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC Clock Failure</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLOCK</name>
                     <description>DFLL Lock</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOVF</name>
                     <description>DFLL Tuner Overflow</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLUNF</name>
                     <description>DFLL Tuner Underflow</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLFAIL</name>
                     <description>DFLL Startup Failure</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKR</name>
                     <description>PLL 0 Lock Rise</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCKF</name>
                     <description>PLL 0 Lock Fall</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKR</name>
                     <description>PLL 1 Lock Rise</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCKF</name>
                     <description>PLL 1 Lock Fall</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY</name>
                     <description>XOSC Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL</name>
                     <description>XOSC Startup Failure</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKFAIL</name>
                     <description>XOSC Clock Failure</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCCKSW</name>
                     <description>XOSC Clock Switch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLOCK</name>
                     <description>DFLL Lock</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOVF</name>
                     <description>DFLL Tuner Overflow</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLUNF</name>
                     <description>DFLL Tuner Underflow</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLFAIL</name>
                     <description>DFLL Startup Failure</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL0LOCK</name>
                     <description>PLL 0 Lock</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL1LOCK</name>
                     <description>PLL 1 Lock</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
